package com.example.listview_002_nest

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*

class MainActivity : AppCompatActivity() {
    val titleArr = arrayOf("ไข่เจียว","ข้าวผัด","ข้าวต้ม","ต้มยำ","ยำมะม่วง","ส้มตำ","น้ำตก","ลาบ","น้ำพริกหนุ่ม","ก๋วยเตี๋ยว")
    val priceArr = arrayOf("30","40","50","60","70","80","90","100","110","120")
    val dataArr = arrayOf("ไข่เจียว เป็นอาหารทอดจากไข่ที่ทำได้ง่าย นิยมใช้ไข่ไก่หรือไข่เป็ด นำไข่มากะเทาะเปลือก ตีไข่ขาวและไข่แดงให้เข้าเป็นเนื้อเดียวกัน แล้วเติมเครื่องปรุงรสคือ น้ำปลา ซอสหอยนางรม นม หรือ น้ำมะนาว ด้วย จากนั้นตั้งกระทะบนเตา และใส่น้ำมันหมูหรือน้ำมันพืช พอร้อน ก็นำลงทอด จนสุกจะได้แผ่นไข่สีเหลืองรับประทานได้"
        ,"ข้าวผัด เป็นอาหารจานเดียวแบบพื้นฐานของเอเชีย เป็นการนำข้าวสวยลงไปผัดคลุกกับซอส หรือน้ำพริก หรือเครื่องปรุงรสต่างๆ เพื่อให้ได้รสชาติ เช่น ซอสมะเขือเทศ, ซอสพริก, ซีอิ๊วดำ หรือซอสถั่วเหลือง และมีการใส่เนื้อสัตว์ชนิดต่างๆ ลงไป เช่น หมู, ไก่, ปลาหมึก, ปู และกุ้ง เป็นต้น โดยเรียกชื่อข้าวผัดชนิดนั้น ๆ ตามชื่อเนื้อสัตว์ที่ใส่ลงไป และอาจใส่ไข่ลงไปผสมด้วย หรืออาจโปะไข่ดาวแต่งหน้าเพิ่มเติม สำหรับผักที่ใช้นิยมใช้ผักคะน้าและโรยหน้าด้วยต้นหอมสับ แต่สำหรับข้าวผัดปูจะไม่ใส่คะน้า"
        ,"ข้าวต้ม เป็นอาหารชนิดหนึ่ง ทำมาจากข้าว โดยวิธีการทำจะคล้าย ๆ กับการหุงข้าวด้วยหม้อปกติ แต่จะแตกต่างกันตรงที่ข้าวต้มจะใส่น้ำมากกว่าการหุงข้าวธรรมดา ระยะเวลาในการทำก็จะใกล้เคียงกับการหุงข้าวธรรมดาหรืออาจจะนานกว่า ข้าวต้มมีหลายประเภทมีทั้งข้าวต้มขาวและข้าวต้มหมู ในบางประเทศอาจใช้ข้าวโอ๊ต ข้าวสาลี ข้าวบาร์เลย์ หรือนำข้าวไปต้มในนม ถ้าต้มนานเกินไปจะกลายเป็นโจ๊ก ซึ่งบางประเทศก็ถือว่าข้าวต้มและโจ๊กก็คืออาหารชนิดเดียวกัน"
        ,"ต้มยำ เป็นแกงไทยที่มีรสเปรี้ยวเผ็ด ต้มยำเป็นอาหารที่รู้จัก และมีชื่อเสียงไปทั่วโลก คำว่า “ต้มยำ” มาจากคำภาษาไทย 2 คำ คือ “ต้ม” และ “ยำ” คำว่า “ต้ม” หมายถึง กิริยาเอาของเหลวใส่ภาชนะแล้วทำให้ร้อนให้เดือดหรือสุก ขณะที่ “ยำ” หมายถึงอาหารลาวและไทยประเภทที่มีรสเปรี้ยวเผ็ด ดังนั้น “ต้มยำ” คือแกงไทยที่มีความเผ็ดร้อนและเปรี้ยว อันที่จริงคุณลักษณะของต้มยำมาจากความแตกต่างระหว่างความเผ็ดร้อนและความเปรี้ยวและกลิ่นหอมของสมุนไพรในน้ำแกง"
        ,"รับประทานเป็นอาหารว่าง  หรือทานกับข้าวสวยร้อนๆ ก็ได้"
        ,"ส้มตำ เป็นอาหารปรุงมาจากการทำตำส้ม คือการทำให้เปรี้ยว ในลาวจะเรียกว่าตำหมากหุ่ง ปรุงโดยนำมะละกอดิบที่สับแล้วฝานหรือขูดเป็นเส้นมาตำในครกเป็นหลัก พร้อมด้วยวัตถุดิบอื่นๆ คือ มะเขือเทศลูกเล็ก มะเขือสีดา มะเขือเปราะ พริกสดหรือพริกแห้ง ถั่วฝักยาว กระเทียม และปรุงรสด้วยน้ำตาลปี๊บ น้ำปลา มะนาว"
        ,"น้ำตกหมู เมนูสุดแซบๆ รสชาติเข้มข้น หอมอร่อยจัดจ้าน เนื้อหมูย่างนุ่มๆ หอมผักสมุนไพรต่างๆ หอมข้าวคั่วมากค่ะ เสิร์ฟเคียงกับผักสดต่างๆ รับประทานกับกับข้าวสวย หรือข้าวเหนียวนึ่งก็ได้"
        ,"ลาบ เป็นอาหารท้องถิ่นทางภาคอีสาน (รวมถึงประเทศลาวและสิบสองปันนา) โดยนำเนื้อมาสับให้ละเอียดแล้วคลุกกับเครื่องปรุง ซึ่งเนื้อที่มาทำลาบเป็นเนื้อหลายชนิด เช่น เนื้อไก่ เนื้อเป็ด เนื้อวัว เนื้อควาย เนื้อปลา เนื้อหมู และเนื้อนก นอกจากนี้ยังสามารถลาบสัตว์จำพวก กวาง เช่น ละมั่ง กระจง เก้ง หรือแม้แต่บึ้ง ก็นำมาลาบได้เช่นกัน ลาบนิยมกินคู่กับข้าวเหนียว"
        ,"น้ำพริกหนุ่ม คือน้ำพริก อาหารพื้นบ้านล้านนาที่รู้จักกันทั่วไป ทำจากพริกชนิดหนึ่งที่เรียกว่าพริกหนุ่มอาจจะใช้พริกหนุ่มที่แก่จัดหรือยังไม่แก่จัดก็ได้แต่ส่วนมากใช้พริกหนุ่มที่ยังไม่แก่จัด หอม และกระเทียม นำมาย่างและโขลกส่วนผสมและเกลือ รับประทานกับแคบหมู ผัก ข้าวเหนียว บางสูตรใส่ปลาร้าสับ และกะปิห่อใบตองย่างไฟ บางสูตรใส่น้ำปลากับเกลือ"
        ,"ก๋วยเตี๋ยว เป็นหนึ่งในอาหารประเภทเส้นของจีนที่ทำจากแป้งข้าวเจ้าโดยมากจะลวกให้สุกในน้ำเดือด สะเด็ดน้ำ แล้วนำมาใส่เครื่องปรุงชนิดต่างๆ นิยมรับประทานทั้งแบบน้ำและแบบแห้ง นิยมใช้ตะเกียบเป็นเครื่องมือช่วยรับประทาน")
    val context = this
    //val title = intent.extras?.getString(MainActivity().KEY_TITLE)
    //val menu = intent.extras?.getString(MainActivity().KEY_MENU)
    public final val KEY_TITLE = "TITLE"
    public final val KEY_MENU = "MENU"
    public final val KEY_DATA = "DATA"
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        setTitle("เมนูอาหาร")
        val mAdp = ArrayAdapter(context,
                    android.R.layout.simple_list_item_1,
                    titleArr)
        lv_result.adapter = mAdp
        lv_result.setOnItemClickListener { parent, view, position, id ->
           // Toast.makeText(context,"ชื่ออาหาร = ${titleArr[position]} ราคา ${priceArr[position]} บาท",Toast.LENGTH_LONG).show()
         val goPagResult = Intent(context,Menu::class.java)
            goPagResult.putExtra(KEY_TITLE,titleArr[position])
            goPagResult.putExtra(KEY_MENU,priceArr[position])
            goPagResult.putExtra(KEY_DATA,dataArr[position])
            startActivity(goPagResult)
        }

    }
}
